#### Terraform Validation & Plan Results
* Terraform Version 📎`1.4.6`
* Working Directory 📂`./tests/e2e`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].time_rotating.rotation: Refreshing state... [id=2023-06-09T10:21:50Z][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.data.databricks_group.group[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.data.databricks_group.group[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.data.databricks_group.group[0]: Read complete after 1s [id=377231223141289][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.data.databricks_group.group[0]: Read complete after 1s [id=377231223141289][0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.azurerm_resource_group.storage_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg][0m
[0m[1mmodule.data_landing_zone.data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_resource_group.data_product_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg][0m
[0m[1mmodule.data_landing_zone.azurerm_resource_group.shared_app_exp_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg][0m
[0m[1mmodule.data_landing_zone.azurerm_resource_group.runtimes_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.azurerm_resource_group.shared_app_aut_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.data.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001][0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstcur][0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstraw][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp][0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstenr][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_user_assigned_identity.user_assigned_identity[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dptest-prd-uai001][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.KeyVault/vaults/dptest-prd-vault001][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_databricks_access_connector.databricks_access_connector[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.Databricks/accessConnectors/dptest-prd-dbac001][0m
[0m[1mmodule.data_landing_zone.data.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dlz02-nsg001][0m
[0m[1mmodule.data_landing_zone.azurerm_data_factory.data_factory: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz02-dev-adf001][0m
[0m[1mmodule.data_landing_zone.data.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dlz02-rt001][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz02-dev-exp-kv001][0m
[0m[1mmodule.data_landing_zone.azapi_resource.storage_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/StorageSubnet][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz02-dev-aut-kv001][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_resource_group[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/64dd4930-ce50-3301-92b4-ddf8c8ed73b0][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azuread_group.security_group[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azuread_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azuread_client_config.current: Read complete after 0s [id=3556be79-2979-4b19-a1af-4dd4e6d9ed7e-baaa7885-90d9-49a6-bff0-c12ec738bf9b-e9f8a9d5-2b4d-4d65-85e3-dcb6ef4988be][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.data.azuread_service_principal.databricks: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.data.azuread_service_principal.databricks: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.data.azuread_service_principal.databricks: Read complete after 1s [id=646e1bfe-cf17-4fdc-afd8-3992fda82399][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azuread_application.application[0]: Refreshing state... [id=b791b072-675e-4928-8df5-695cd6749e40][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.KeyVault/vaults/dptest-prd-vault001/providers/Microsoft.Authorization/roleAssignments/0749f31d-58af-8a47-e28b-2c7b65019b05][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dlz02-rt001][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.KeyVault/vaults/dptest-prd-vault001/providers/Microsoft.Authorization/roleAssignments/ae61b965-3b3c-cba2-2f61-3ae81c54edfa][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dlz02-nsg001][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azuread_group.security_group[0]: Read complete after 1s [id=238f1be3-8722-41ab-ac00-0ac9b8703915][0m
[0m[1mmodule.data_landing_zone.azapi_resource.runtimes_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/RuntimesSubnet][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz02-dev-exp-kv001/providers/Microsoft.Authorization/roleAssignments/7a9f489b-22a6-925d-24a9-45dc7bce101b][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz02-dev-aut-kv001/providers/Microsoft.Authorization/roleAssignments/dd8bb666-44ad-b1c2-3ec0-8ed3cf0d8ce0][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.data.azuread_service_principal.databricks: Read complete after 1s [id=646e1bfe-cf17-4fdc-afd8-3992fda82399][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_role_assignment.databricks_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz02-dev-aut-kv001/providers/Microsoft.Authorization/roleAssignments/741dd189-1b2d-caaf-5378-fd9786cab933][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.security_group_roleassignment_resource_group[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/4c12d8db-fc62-82de-99a8-809a94d9a729][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.security_group_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.KeyVault/vaults/dptest-prd-vault001/providers/Microsoft.Authorization/roleAssignments/60b18a3a-50a7-9916-b063-dfd49d2d0895][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_role_assignment.databricks_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz02-dev-exp-kv001/providers/Microsoft.Authorization/roleAssignments/f29cf62e-6cff-1c0a-7f91-8950547e3574][0m
[0m[1mmodule.data_landing_zone.azurerm_private_endpoint.data_factory_private_endpoint_data_factory: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-adf001-datafactory-pe][0m
[0m[1mmodule.data_landing_zone.azapi_resource.powerbi_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/PowerBiSubnet][0m
[0m[1mmodule.data_landing_zone.azurerm_private_endpoint.data_factory_private_endpoint_portal: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-adf001-portal-pe][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azuread_service_principal.service_principal[0]: Refreshing state... [id=0ab30875-1393-4619-9bde-c76fb7d133ec][0m
[0m[1mmodule.data_landing_zone.azapi_resource.shared_app_aut_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/SharedAppAutomationSubnet][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azuread_service_principal_password.service_principal_password[0]: Refreshing state... [id=0ab30875-1393-4619-9bde-c76fb7d133ec/password/dfbd534b-4653-4b77-b55b-7515ddce410f][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.service_principal_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.KeyVault/vaults/dptest-prd-vault001/providers/Microsoft.Authorization/roleAssignments/e3f47ad5-3db3-ed8d-62a3-2c08b0d55c8a][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.service_principal_roleassignment_resource_group[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/cd87f7e4-b9aa-2769-5fa7-150641ad0fc2][0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstcur/managementPolicies/default][0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstcur-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.azurerm_role_assignment.current_roleassignment_storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstcur/providers/Microsoft.Authorization/roleAssignments/323e3413-9c85-2866-ed82-ff0c44510901][0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstcur-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.azurerm_role_assignment.current_roleassignment_storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstenr/providers/Microsoft.Authorization/roleAssignments/4a0696d2-17f8-bda1-f811-de045535a633][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/managementPolicies/default][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstwsp-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstenr-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstenr/managementPolicies/default][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstwsp-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_queue[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstwsp-queue-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_role_assignment.current_roleassignment_storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/providers/Microsoft.Authorization/roleAssignments/c68e8f07-cb6d-9b43-5cae-739983326b8a][0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstenr-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_table[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstwsp-table-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstraw/managementPolicies/default][0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstraw-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.azurerm_role_assignment.current_roleassignment_storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstraw/providers/Microsoft.Authorization/roleAssignments/85e83ac8-ccbb-1f1d-e853-4f1ee727501a][0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstraw-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_storage_account.datalake_curated: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.azapi_resource.shared_app_exp_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/SharedAppExperimentationSubnet][0m
[0m[1mmodule.data_landing_zone.module.shir_001.azurerm_lb_nat_pool.lb_nat_pool: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz02-dev-shir001-lb/inboundNatPools/mydlz02-dev-shir001-natpool][0m
[0m[1mmodule.data_landing_zone.module.shir_001.random_password.password: Refreshing state... [id=none][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_storage_account.datalake_enriched: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.azurerm_storage_container.datalake_containers["data"]: Refreshing state... [id=https://mydlz02devstcur.blob.core.windows.net/data][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-aut-kv001-pe][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_storage_account.datalake_workspace: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_storage_container.datalake_containers["data"]: Refreshing state... [id=https://mydlz02devstwsp.blob.core.windows.net/data][0m
[0m[1mmodule.data_landing_zone.module.shir_001.azurerm_lb.lb: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz02-dev-shir001-lb][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_storage_account.datalake_raw: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_storage_account.datalake_curated: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstcur][0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.azurerm_storage_container.datalake_containers["data"]: Refreshing state... [id=https://mydlz02devstenr.blob.core.windows.net/data][0m
[0m[1mmodule.data_landing_zone.module.shir_001.data.azurerm_data_factory.data_factory: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.shir_001.azurerm_lb_backend_address_pool.lb_backend_address_pool: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz02-dev-shir001-lb/backendAddressPools/mydlz02-dev-shir001-backendaddresspool][0m
[0m[1mmodule.data_landing_zone.module.shir_001.azurerm_lb_probe.lb_probe: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz02-dev-shir001-lb/probes/mydlz02-dev-shir001-probe][0m
[0m[1mmodule.data_landing_zone.azapi_resource.databricks_private_subnet_001: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DatabricksPrivateSubnet001][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-exp-kv001-pe][0m
[0m[1mmodule.data_landing_zone.module.shir_001.data.azurerm_data_factory.data_factory: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz02-dev-adf001][0m
[0m[1mmodule.data_landing_zone.module.shir_001.azurerm_data_factory_integration_runtime_self_hosted.data_factory_shir: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz02-dev-adf001/integrationruntimes/mydlz02-dev-shir001][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_storage_account.datalake_enriched: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstenr][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_storage_account.datalake_workspace: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.dbac_roleassignment_storage_workspace[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/providers/Microsoft.Authorization/roleAssignments/917502f3-9aac-ca33-8470-de91bf78c400][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.security_group_roleassignment_storage_workspace[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/providers/Microsoft.Authorization/roleAssignments/1cf669c6-8018-d2f1-9f51-cafe47568386][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_storage_account.datalake_raw: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstraw][0m
[0m[1mmodule.data_landing_zone.module.shir_001.azurerm_windows_virtual_machine_scale_set.vmss: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.Compute/virtualMachineScaleSets/mydlz02-dev-shir001][0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.azurerm_storage_container.datalake_containers["data"]: Refreshing state... [id=https://mydlz02devstraw.blob.core.windows.net/data][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_storage_container.container_workspace[0]: Refreshing state... [id=https://mydlz02devstwsp.blob.core.windows.net/dptestprd][0m
[0m[1mmodule.data_landing_zone.azapi_resource.databricks_public_subnet_001: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DatabricksPublicSubnet001][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.service_principal_roleassignment_container_workspace[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/blobServices/default/containers/dptestprd/providers/Microsoft.Authorization/roleAssignments/0602a082-bcd1-242c-f3a4-fd94bc512654][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.dbac_roleassignment_container_workspace[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/blobServices/default/containers/dptestprd/providers/Microsoft.Authorization/roleAssignments/9796fac5-5e8a-baff-dd6a-b4f0905a6b58][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_container_workspace[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/blobServices/default/containers/dptestprd/providers/Microsoft.Authorization/roleAssignments/c9ff6675-e494-cd6c-df36-788edeb6bdd3][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.security_group_roleassignment_container_workspace[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/blobServices/default/containers/dptestprd/providers/Microsoft.Authorization/roleAssignments/81a7f21f-8fd6-e950-c47d-c7672d865fd6][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].time_sleep.sleep_dbac: Refreshing state... [id=2023-06-09T10:34:50Z][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_databricks_workspace.databricks: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.Databricks/workspaces/mydlz02-dev-aut-dbw001][0m
[0m[1mmodule.data_landing_zone.azapi_resource.databricks_private_subnet_002: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DatabricksPrivateSubnet002][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_ui: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-aut-dbw001-uiapi-pe][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-aut-dbw001-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-aut-dbw001-blob-pe][0m
[0m[1mmodule.data_landing_zone.azapi_resource.databricks_public_subnet_002: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DatabricksPublicSubnet002][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_databricks_workspace.databricks: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.Databricks/workspaces/mydlz02-dev-exp-dbw001][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_subnet.subnets["DataProductSubnet-dptest-prd1"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd1][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_subnet.subnets["DataProductSubnet-dptest-prd2"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd2][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_subnet_network_security_group_association.devops_subnet_nsg["DataProductSubnet-dptest-prd1"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd1][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.service_principal_roleassignment_subnets["DataProductSubnet-dptest-prd2"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd2/providers/Microsoft.Authorization/roleAssignments/4b6a6e93-458f-7f0a-85ae-6679c2a3baca][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_subnets["DataProductSubnet-dptest-prd1"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd1/providers/Microsoft.Authorization/roleAssignments/764cafee-e468-7258-72d2-0cf008322c4e][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.service_principal_roleassignment_subnets["DataProductSubnet-dptest-prd1"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd1/providers/Microsoft.Authorization/roleAssignments/f3646ba9-809b-f86a-8475-64745f179771][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_subnet_network_security_group_association.devops_subnet_nsg["DataProductSubnet-dptest-prd2"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd2][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_subnet_route_table_association.devops_subnet_routetable["DataProductSubnet-dptest-prd1"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd1][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_private_endpoint.key_vault_private_endpoint[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.Network/privateEndpoints/dptest-prd-vault001-pe][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_subnet_route_table_association.devops_subnet_routetable["DataProductSubnet-dptest-prd2"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd2][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_subnets["DataProductSubnet-dptest-prd2"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd2/providers/Microsoft.Authorization/roleAssignments/c64a194d-0f20-9828-34f2-6c9a4c922dcc][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.security_group_roleassignment_subnets["DataProductSubnet-dptest-prd1"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd1/providers/Microsoft.Authorization/roleAssignments/691c2f00-cf1d-5c12-9bb1-850bb92ca3ab][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.security_group_roleassignment_subnets["DataProductSubnet-dptest-prd2"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd2/providers/Microsoft.Authorization/roleAssignments/08fb16a5-91e7-aaf9-bf82-2b4b9f833d6c][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_ui: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-exp-dbw001-uiapi-pe][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-exp-dbw001-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-exp-dbw001-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].time_sleep.sleep_key_vault: Refreshing state... [id=2023-06-09T10:28:24Z][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_key_vault_secret.key_vault_secret_security_group_display_name[0]: Refreshing state... [id=https://dptest-prd-vault001.vault.azure.net/secrets/securityGroupDisplayName/6e7b172339d0465f95d7fae158f6f49f][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_key_vault_secret.key_vault_secret_service_principal_client_secret[0]: Refreshing state... [id=https://dptest-prd-vault001.vault.azure.net/secrets/servicePrincipalClientSecret/224ea5e9c8914d24b300e2d917c43fdb][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_key_vault_secret.key_vault_secret_service_principal_object_id[0]: Refreshing state... [id=https://dptest-prd-vault001.vault.azure.net/secrets/servicePrincipalObjectId/6f3918baadf14da08ecd8d82c53dcb6a][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_key_vault_secret.key_vault_secret_service_principal_client_id[0]: Refreshing state... [id=https://dptest-prd-vault001.vault.azure.net/secrets/servicePrincipalClientId/95f0cf48f1a64c959781ff4e029b9d75][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_key_vault_secret.key_vault_secret_security_group_object_id[0]: Refreshing state... [id=https://dptest-prd-vault001.vault.azure.net/secrets/securityGroupObjectId/199c7c811e204b9493e831ffde81c558][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_key_vault_secret.key_vault_secret_service_principal_tenant_id[0]: Refreshing state... [id=https://dptest-prd-vault001.vault.azure.net/secrets/servicePrincipalTenantId/8dd5c04c9dde4c91b2ba8403a5455cd7][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.databricks_cluster_policy.cluster_policy["cluster-policy-all-purpose"]: Refreshing state... [id=30644216E4007EFC][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.databricks_metastore_assignment.metastore_assignment[0]: Refreshing state... [id=7817328129381650|65114305-ebd5-447d-860d-6396356927b1][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.databricks_secret_scope.platform_secret_scope: Refreshing state... [id=platform-secret-scope][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.databricks_cluster_policy.cluster_policy["cluster-policy-job"]: Refreshing state... [id=30644216E4007EFB][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.time_sleep.sleep_metastore_assignment: Refreshing state... [id=2023-06-09T10:34:39Z][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.databricks_mws_permission_assignment.permission_assignment[0]: Refreshing state... [id=7817328129381650|377231223141289][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.time_sleep.sleep_permission_assignment: Refreshing state... [id=2023-06-09T10:35:13Z][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.databricks_secret_acl.secret_acl[0]: Refreshing state... [id=platform-secret-scope|||test][0m

[1m[36mNote:[0m[1m Objects have changed outside of Terraform
[0m
Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

[1m  # module.data_landing_zone.module.shir_001.azurerm_lb.lb[0m has been deleted
[0m  [31m-[0m[0m resource "azurerm_lb" "lb" {
      [31m-[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz02-dev-shir001-lb" [90m-> null[0m[0m
        name                 = "mydlz02-dev-shir001-lb"
      [31m-[0m[0m resource_group_name  = "mydlz02-dev-runtimes-rg" [90m-> null[0m[0m
        [90m# (5 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m frontend_ip_configuration {
            id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz02-dev-shir001-lb/frontendIPConfigurations/frontendipconfiguration"
          [31m-[0m[0m name                          = "frontendipconfiguration" [90m-> null[0m[0m
            [90m# (8 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_landing_zone.module.shir_001.azurerm_lb_backend_address_pool.lb_backend_address_pool[0m has been deleted
[0m  [31m-[0m[0m resource "azurerm_lb_backend_address_pool" "lb_backend_address_pool" {
      [31m-[0m[0m id                        = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz02-dev-shir001-lb/backendAddressPools/mydlz02-dev-shir001-backendaddresspool" [90m-> null[0m[0m
        name                      = "mydlz02-dev-shir001-backendaddresspool"
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.shir_001.azurerm_lb_probe.lb_probe[0m has been deleted
[0m  [31m-[0m[0m resource "azurerm_lb_probe" "lb_probe" {
      [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz02-dev-shir001-lb/probes/mydlz02-dev-shir001-probe" [90m-> null[0m[0m
        name                = "mydlz02-dev-shir001-probe"
        [90m# (8 unchanged attributes hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m

Terraform will perform the following actions:

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].databricks_catalog.automation_catalog[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_catalog" "automation_catalog" {
      [32m+[0m[0m comment       = "Data Product Catalog - dptest-prd"
      [32m+[0m[0m force_destroy = false
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m metastore_id  = "65114305-ebd5-447d-860d-6396356927b1"
      [32m+[0m[0m name          = "dptest-prd"
      [32m+[0m[0m owner         = (known after apply)
      [32m+[0m[0m properties    = {
          [32m+[0m[0m "purpose" = "Data Product Catalog - dptest-prd"
        }
      [32m+[0m[0m storage_root  = "abfss://dptestprd@mydlz02devstwsp.dfs.core.windows.net"
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].databricks_external_location.automation_external_location[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "automation_external_location" {
      [32m+[0m[0m comment         = "Default Storage for dptest-prd Data Product"
      [32m+[0m[0m credential_name = "dptest-prd"
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "dptest-prd"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m url             = "abfss://dptestprd@mydlz02devstwsp.dfs.core.windows.net"
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].databricks_grants.grants_automation_catalog[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grants" "grants_automation_catalog" {
      [32m+[0m[0m catalog = "dptest-prd"
      [32m+[0m[0m id      = (known after apply)

      [32m+[0m[0m grant {
          [32m+[0m[0m principal  = "test"
          [32m+[0m[0m privileges = [
              [32m+[0m[0m "ALL_PRIVILEGES",
            ]
        }
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].databricks_storage_credential.automation_storage_credential[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_storage_credential" "automation_storage_credential" {
      [32m+[0m[0m comment      = "Managed identity credential for dptest-prd Data Product"
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m metastore_id = (known after apply)
      [32m+[0m[0m name         = "dptest-prd"
      [32m+[0m[0m owner        = (known after apply)

      [32m+[0m[0m azure_managed_identity {
          [32m+[0m[0m access_connector_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.Databricks/accessConnectors/dptest-prd-dbac001"
        }
    }

[1m  # module.data_landing_zone.module.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_web[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "databricks_private_endpoint_web" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydlz02-dev-aut-dbw001-web-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "westeurope"
      [32m+[0m[0m name                          = "mydlz02-dev-aut-dbw001-web-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydlz02-dev-shared-app-aut-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/SharedAppAutomationSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydlz02-dev-aut-dbw001-web-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydlz02-dev-aut-dbw001-web-pe"
          [32m+[0m[0m private_connection_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.Databricks/workspaces/mydlz02-dev-aut-dbw001"
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "browser_authentication",
            ]
        }
    }

[1m  # module.data_landing_zone.module.databricks_automation_configuration.databricks_cluster_policy.cluster_policy["cluster-policy-all-purpose"][0m will be created
[0m  [32m+[0m[0m resource "databricks_cluster_policy" "cluster_policy" {
      [32m+[0m[0m definition = jsonencode(
            {
              [32m+[0m[0m "autoscale.max_workers"               = {
                  [32m+[0m[0m defaultValue = 5
                  [32m+[0m[0m hidden       = false
                  [32m+[0m[0m isOptional   = false
                  [32m+[0m[0m maxValue     = 10
                  [32m+[0m[0m type         = "range"
                }
              [32m+[0m[0m "autoscale.min_workers"               = {
                  [32m+[0m[0m defaultValue = 1
                  [32m+[0m[0m hidden       = false
                  [32m+[0m[0m isOptional   = false
                  [32m+[0m[0m maxValue     = 10
                  [32m+[0m[0m type         = "range"
                }
              [32m+[0m[0m autotermination_minutes               = {
                  [32m+[0m[0m defaultValue = 30
                  [32m+[0m[0m hidden       = false
                  [32m+[0m[0m isOptional   = false
                  [32m+[0m[0m maxValue     = 120
                  [32m+[0m[0m minValue     = 1
                  [32m+[0m[0m type         = "range"
                }
              [32m+[0m[0m "azure_attributes.availability"       = {
                  [32m+[0m[0m defaultValue = "ON_DEMAND_AZURE"
                  [32m+[0m[0m hidden       = true
                  [32m+[0m[0m isOptional   = false
                  [32m+[0m[0m type         = "fixed"
                }
              [32m+[0m[0m "azure_attributes.spot_bid_max_price" = {
                  [32m+[0m[0m hidden     = true
                  [32m+[0m[0m isOptional = false
                  [32m+[0m[0m type       = "fixed"
                  [32m+[0m[0m value      = -1
                }
              [32m+[0m[0m "cluster_log_conf.path"               = {
                  [32m+[0m[0m hidden     = false
                  [32m+[0m[0m isOptional = false
                  [32m+[0m[0m type       = "fixed"
                  [32m+[0m[0m value      = "dbfs:/cluster-logs"
                }
              [32m+[0m[0m "cluster_log_conf.type"               = {
                  [32m+[0m[0m hidden     = false
                  [32m+[0m[0m isOptional = false
                  [32m+[0m[0m type       = "fixed"
                  [32m+[0m[0m value      = "DBFS"
                }
              [32m+[0m[0m cluster_type                          = {
                  [32m+[0m[0m type  = "fixed"
                  [32m+[0m[0m value = "all-purpose"
                }
              [32m+[0m[0m "custom_tags.costCenter"              = {
                  [32m+[0m[0m hidden     = false
                  [32m+[0m[0m isOptional = false
                  [32m+[0m[0m pattern    = "[A-Z]{5}-[0-9]{5}"
                  [32m+[0m[0m type       = "regex"
                }
              [32m+[0m[0m data_security_mode                    = {
                  [32m+[0m[0m defaultValue = "SINGLE_USER"
                  [32m+[0m[0m hidden       = true
                  [32m+[0m[0m type         = "allowlist"
                  [32m+[0m[0m values       = [
                      [32m+[0m[0m "SINGLE_USER",
                      [32m+[0m[0m "NONE",
                    ]
                }
              [32m+[0m[0m dbus_per_hour                         = {
                  [32m+[0m[0m maxValue = 100
                  [32m+[0m[0m type     = "range"
                }
              [32m+[0m[0m driver_instance_pool_id               = {
                  [32m+[0m[0m hidden     = true
                  [32m+[0m[0m isOptional = true
                  [32m+[0m[0m type       = "forbidden"
                }
              [32m+[0m[0m enable_local_disk_encryption          = {
                  [32m+[0m[0m hidden     = true
                  [32m+[0m[0m isOptional = false
                  [32m+[0m[0m type       = "fixed"
                  [32m+[0m[0m value      = true
                }
              [32m+[0m[0m instance_pool_id                      = {
                  [32m+[0m[0m hidden     = true
                  [32m+[0m[0m isOptional = true
                  [32m+[0m[0m type       = "forbidden"
                }
              [32m+[0m[0m num_workers                           = {
                  [32m+[0m[0m hidden     = true
                  [32m+[0m[0m isOptional = true
                  [32m+[0m[0m type       = "forbidden"
                }
              [32m+[0m[0m spark_version                         = {
                  [32m+[0m[0m defaultValue = "auto:latest-lts"
                  [32m+[0m[0m hidden       = false
                  [32m+[0m[0m isOptional   = false
                  [32m+[0m[0m type         = "unlimited"
                }
              [32m+[0m[0m "ssh_public_keys.*"                   = {
                  [32m+[0m[0m hidden     = true
                  [32m+[0m[0m isOptional = true
                  [32m+[0m[0m type       = "forbidden"
                }
            }
        )
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m name       = "cluster-policy-all-purpose"
      [32m+[0m[0m policy_id  = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricks_automation_configuration.databricks_cluster_policy.cluster_policy["cluster-policy-job"][0m will be created
[0m  [32m+[0m[0m resource "databricks_cluster_policy" "cluster_policy" {
      [32m+[0m[0m definition = jsonencode(
            {
              [32m+[0m[0m "autoscale.max_workers"                       = {
                  [32m+[0m[0m defaultValue = 5
                  [32m+[0m[0m hidden       = false
                  [32m+[0m[0m isOptional   = false
                  [32m+[0m[0m maxValue     = 10
                  [32m+[0m[0m type         = "range"
                }
              [32m+[0m[0m "autoscale.min_workers"                       = {
                  [32m+[0m[0m defaultValue = 1
                  [32m+[0m[0m hidden       = false
                  [32m+[0m[0m isOptional   = false
                  [32m+[0m[0m maxValue     = 10
                  [32m+[0m[0m type         = "range"
                }
              [32m+[0m[0m "azure_attributes.availability"               = {
                  [32m+[0m[0m defaultValue = "ON_DEMAND_AZURE"
                  [32m+[0m[0m hidden       = true
                  [32m+[0m[0m isOptional   = false
                  [32m+[0m[0m type         = "fixed"
                }
              [32m+[0m[0m "azure_attributes.spot_bid_max_price"         = {
                  [32m+[0m[0m hidden     = true
                  [32m+[0m[0m isOptional = false
                  [32m+[0m[0m type       = "fixed"
                  [32m+[0m[0m value      = -1
                }
              [32m+[0m[0m "cluster_log_conf.path"                       = {
                  [32m+[0m[0m hidden     = false
                  [32m+[0m[0m isOptional = false
                  [32m+[0m[0m type       = "fixed"
                  [32m+[0m[0m value      = "dbfs:/cluster-logs"
                }
              [32m+[0m[0m "cluster_log_conf.type"                       = {
                  [32m+[0m[0m hidden     = false
                  [32m+[0m[0m isOptional = false
                  [32m+[0m[0m type       = "fixed"
                  [32m+[0m[0m value      = "DBFS"
                }
              [32m+[0m[0m cluster_type                                  = {
                  [32m+[0m[0m type  = "fixed"
                  [32m+[0m[0m value = "job"
                }
              [32m+[0m[0m "custom_tags.costCenter"                      = {
                  [32m+[0m[0m hidden     = false
                  [32m+[0m[0m isOptional = false
                  [32m+[0m[0m pattern    = "[A-Z]{5}-[0-9]{5}"
                  [32m+[0m[0m type       = "regex"
                }
              [32m+[0m[0m enable_local_disk_encryption                  = {
                  [32m+[0m[0m hidden     = true
                  [32m+[0m[0m isOptional = false
                  [32m+[0m[0m type       = "fixed"
                  [32m+[0m[0m value      = true
                }
              [32m+[0m[0m num_workers                                   = {
                  [32m+[0m[0m hidden     = true
                  [32m+[0m[0m isOptional = true
                  [32m+[0m[0m type       = "forbidden"
                }
              [32m+[0m[0m "spark_conf.spark.databricks.cluster.profile" = {
                  [32m+[0m[0m hidden     = true
                  [32m+[0m[0m isOptional = true
                  [32m+[0m[0m type       = "forbidden"
                }
              [32m+[0m[0m spark_version                                 = {
                  [32m+[0m[0m defaultValue = "auto:latest-lts"
                  [32m+[0m[0m hidden       = false
                  [32m+[0m[0m isOptional   = false
                  [32m+[0m[0m type         = "unlimited"
                }
              [32m+[0m[0m "ssh_public_keys.*"                           = {
                  [32m+[0m[0m hidden     = true
                  [32m+[0m[0m isOptional = true
                  [32m+[0m[0m type       = "forbidden"
                }
            }
        )
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m name       = "cluster-policy-job"
      [32m+[0m[0m policy_id  = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricks_automation_configuration.databricks_metastore_assignment.metastore_assignment[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_metastore_assignment" "metastore_assignment" {
      [32m+[0m[0m default_catalog_name = "perfectthymetech-westeurope"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m metastore_id         = "65114305-ebd5-447d-860d-6396356927b1"
      [32m+[0m[0m workspace_id         = 91903494923136
    }

[1m  # module.data_landing_zone.module.databricks_automation_configuration.databricks_mws_permission_assignment.permission_assignment[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_mws_permission_assignment" "permission_assignment" {
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m permissions  = [
          [32m+[0m[0m "ADMIN",
        ]
      [32m+[0m[0m principal_id = 377231223141289
      [32m+[0m[0m workspace_id = 91903494923136
    }

[1m  # module.data_landing_zone.module.databricks_automation_configuration.databricks_secret_acl.secret_acl[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_secret_acl" "secret_acl" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m permission = "MANAGE"
      [32m+[0m[0m principal  = "test"
      [32m+[0m[0m scope      = "platform-secret-scope"
    }

[1m  # module.data_landing_zone.module.databricks_automation_configuration.databricks_secret_scope.platform_secret_scope[0m will be created
[0m  [32m+[0m[0m resource "databricks_secret_scope" "platform_secret_scope" {
      [32m+[0m[0m backend_type = "AZURE_KEYVAULT"
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m name         = "platform-secret-scope"

      [32m+[0m[0m keyvault_metadata {
          [32m+[0m[0m dns_name    = "https://mydlz02-dev-aut-kv001.vault.azure.net/"
          [32m+[0m[0m resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz02-dev-aut-kv001"
        }
    }

[1m  # module.data_landing_zone.module.databricks_automation_configuration.time_sleep.sleep_metastore_assignment[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_metastore_assignment" {
      [32m+[0m[0m create_duration = "30s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricks_automation_configuration.time_sleep.sleep_permission_assignment[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_permission_assignment" {
      [32m+[0m[0m create_duration = "30s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricks_experimentation.azurerm_key_vault.key_vault[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_key_vault" "key_vault" {
      [33m~[0m[0m access_policy                   = [
          [31m-[0m[0m {
              [31m-[0m[0m application_id          = ""
              [31m-[0m[0m certificate_permissions = []
              [31m-[0m[0m key_permissions         = []
              [31m-[0m[0m object_id               = "646e1bfe-cf17-4fdc-afd8-3992fda82399"
              [31m-[0m[0m secret_permissions      = [
                  [31m-[0m[0m "Get",
                  [31m-[0m[0m "List",
                ]
              [31m-[0m[0m storage_permissions     = []
              [31m-[0m[0m tenant_id               = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e"
            },
        ]
        id                              = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz02-dev-exp-kv001"
        name                            = "mydlz02-dev-exp-kv001"
        tags                            = {}
        [90m# (12 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.shir_001.azurerm_lb.lb[0m will be created
[0m  [32m+[0m[0m resource "azurerm_lb" "lb" {
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m location             = "westeurope"
      [32m+[0m[0m name                 = "mydlz02-dev-shir001-lb"
      [32m+[0m[0m private_ip_address   = (known after apply)
      [32m+[0m[0m private_ip_addresses = (known after apply)
      [32m+[0m[0m resource_group_name  = "mydlz02-dev-runtimes-rg"
      [32m+[0m[0m sku                  = "Standard"
      [32m+[0m[0m sku_tier             = "Regional"

      [32m+[0m[0m frontend_ip_configuration {
          [32m+[0m[0m gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          [32m+[0m[0m id                                                 = (known after apply)
          [32m+[0m[0m inbound_nat_rules                                  = (known after apply)
          [32m+[0m[0m load_balancer_rules                                = (known after apply)
          [32m+[0m[0m name                                               = "frontendipconfiguration"
          [32m+[0m[0m outbound_rules                                     = (known after apply)
          [32m+[0m[0m private_ip_address                                 = (known after apply)
          [32m+[0m[0m private_ip_address_allocation                      = "Dynamic"
          [32m+[0m[0m private_ip_address_version                         = "IPv4"
          [32m+[0m[0m public_ip_address_id                               = (known after apply)
          [32m+[0m[0m public_ip_prefix_id                                = (known after apply)
          [32m+[0m[0m subnet_id                                          = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/RuntimesSubnet"
          [32m+[0m[0m zones                                              = [
              [32m+[0m[0m "1",
              [32m+[0m[0m "2",
              [32m+[0m[0m "3",
            ]
        }
    }

[1m  # module.data_landing_zone.module.shir_001.azurerm_lb_backend_address_pool.lb_backend_address_pool[0m will be created
[0m  [32m+[0m[0m resource "azurerm_lb_backend_address_pool" "lb_backend_address_pool" {
      [32m+[0m[0m backend_ip_configurations = (known after apply)
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m inbound_nat_rules         = (known after apply)
      [32m+[0m[0m load_balancing_rules      = (known after apply)
      [32m+[0m[0m loadbalancer_id           = (known after apply)
      [32m+[0m[0m name                      = "mydlz02-dev-shir001-backendaddresspool"
      [32m+[0m[0m outbound_rules            = (known after apply)
    }

[1m  # module.data_landing_zone.module.shir_001.azurerm_lb_nat_rule.lb_nat_rule[0m will be created
[0m  [32m+[0m[0m resource "azurerm_lb_nat_rule" "lb_nat_rule" {
      [32m+[0m[0m backend_address_pool_id        = (known after apply)
      [32m+[0m[0m backend_ip_configuration_id    = (known after apply)
      [32m+[0m[0m backend_port                   = 3389
      [32m+[0m[0m enable_floating_ip             = false
      [32m+[0m[0m enable_tcp_reset               = true
      [32m+[0m[0m frontend_ip_configuration_id   = (known after apply)
      [32m+[0m[0m frontend_ip_configuration_name = "frontendipconfiguration"
      [32m+[0m[0m frontend_port_end              = 50099
      [32m+[0m[0m frontend_port_start            = 50000
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m idle_timeout_in_minutes        = 4
      [32m+[0m[0m loadbalancer_id                = (known after apply)
      [32m+[0m[0m name                           = "mydlz02-dev-shir001-natrule"
      [32m+[0m[0m protocol                       = "Tcp"
      [32m+[0m[0m resource_group_name            = "mydlz02-dev-runtimes-rg"
    }

[1m  # module.data_landing_zone.module.shir_001.azurerm_lb_probe.lb_probe[0m will be created
[0m  [32m+[0m[0m resource "azurerm_lb_probe" "lb_probe" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m interval_in_seconds = 5
      [32m+[0m[0m load_balancer_rules = (known after apply)
      [32m+[0m[0m loadbalancer_id     = (known after apply)
      [32m+[0m[0m name                = "mydlz02-dev-shir001-probe"
      [32m+[0m[0m number_of_probes    = 2
      [32m+[0m[0m port                = 80
      [32m+[0m[0m probe_threshold     = 1
      [32m+[0m[0m protocol            = "Http"
      [32m+[0m[0m request_path        = "/"
    }

[1m  # module.data_landing_zone.module.shir_001.azurerm_lb_rule.lb_rule[0m will be created
[0m  [32m+[0m[0m resource "azurerm_lb_rule" "lb_rule" {
      [32m+[0m[0m backend_address_pool_ids       = (known after apply)
      [32m+[0m[0m backend_port                   = 80
      [32m+[0m[0m disable_outbound_snat          = false
      [32m+[0m[0m enable_floating_ip             = false
      [32m+[0m[0m enable_tcp_reset               = true
      [32m+[0m[0m frontend_ip_configuration_id   = (known after apply)
      [32m+[0m[0m frontend_ip_configuration_name = "frontendipconfiguration"
      [32m+[0m[0m frontend_port                  = 80
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m idle_timeout_in_minutes        = 4
      [32m+[0m[0m load_distribution              = "Default"
      [32m+[0m[0m loadbalancer_id                = (known after apply)
      [32m+[0m[0m name                           = "mydlz02-dev-shir001-rule"
      [32m+[0m[0m probe_id                       = (known after apply)
      [32m+[0m[0m protocol                       = "Tcp"
    }

[1m  # module.data_landing_zone.module.shir_001.azurerm_windows_virtual_machine_scale_set.vmss[0m will be created
[0m  [32m+[0m[0m resource "azurerm_windows_virtual_machine_scale_set" "vmss" {
      [32m+[0m[0m admin_password                                    = (sensitive value)
      [32m+[0m[0m admin_username                                    = (sensitive value)
      [32m+[0m[0m computer_name_prefix                              = "mydlz02-d"
      [32m+[0m[0m custom_data                                       = (sensitive value)
      [32m+[0m[0m do_not_run_extensions_on_overprovisioned_machines = false
      [32m+[0m[0m enable_automatic_updates                          = true
      [32m+[0m[0m encryption_at_host_enabled                        = true
      [32m+[0m[0m extension_operations_enabled                      = true
      [32m+[0m[0m extensions_time_budget                            = "PT1H30M"
      [32m+[0m[0m id                                                = (known after apply)
      [32m+[0m[0m instances                                         = 1
      [32m+[0m[0m location                                          = "westeurope"
      [32m+[0m[0m max_bid_price                                     = -1
      [32m+[0m[0m name                                              = "mydlz02-dev-shir001"
      [32m+[0m[0m overprovision                                     = false
      [32m+[0m[0m platform_fault_domain_count                       = (known after apply)
      [32m+[0m[0m priority                                          = "Regular"
      [32m+[0m[0m provision_vm_agent                                = true
      [32m+[0m[0m resource_group_name                               = "mydlz02-dev-runtimes-rg"
      [32m+[0m[0m scale_in_policy                                   = (known after apply)
      [32m+[0m[0m secure_boot_enabled                               = true
      [32m+[0m[0m single_placement_group                            = true
      [32m+[0m[0m sku                                               = "Standard_D4ads_v5"
      [32m+[0m[0m timezone                                          = "UTC"
      [32m+[0m[0m unique_id                                         = (known after apply)
      [32m+[0m[0m upgrade_mode                                      = "Automatic"
      [32m+[0m[0m vtpm_enabled                                      = true
      [32m+[0m[0m zone_balance                                      = false
      [32m+[0m[0m zones                                             = [
          [32m+[0m[0m "1",
          [32m+[0m[0m "2",
          [32m+[0m[0m "3",
        ]

      [32m+[0m[0m automatic_os_upgrade_policy {
          [32m+[0m[0m disable_automatic_rollback  = false
          [32m+[0m[0m enable_automatic_os_upgrade = false
        }

      [32m+[0m[0m extension {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }

      [32m+[0m[0m network_interface {
          [32m+[0m[0m enable_accelerated_networking = false
          [32m+[0m[0m enable_ip_forwarding          = false
          [32m+[0m[0m name                          = "mydlz02-dev-shir001-nic"
          [32m+[0m[0m primary                       = true

          [32m+[0m[0m ip_configuration {
              [32m+[0m[0m load_balancer_backend_address_pool_ids = (known after apply)
              [32m+[0m[0m load_balancer_inbound_nat_rules_ids    = (known after apply)
              [32m+[0m[0m name                                   = "mydlz02-dev-shir001-ipconfig"
              [32m+[0m[0m primary                                = true
              [32m+[0m[0m subnet_id                              = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/RuntimesSubnet"
              [32m+[0m[0m version                                = "IPv4"
            }
        }

      [32m+[0m[0m os_disk {
          [32m+[0m[0m caching                   = "ReadWrite"
          [32m+[0m[0m disk_size_gb              = (known after apply)
          [32m+[0m[0m storage_account_type      = "Premium_ZRS"
          [32m+[0m[0m write_accelerator_enabled = false
        }

      [32m+[0m[0m source_image_reference {
          [32m+[0m[0m offer     = "WindowsServer"
          [32m+[0m[0m publisher = "MicrosoftWindowsServer"
          [32m+[0m[0m sku       = "2022-datacenter-azure-edition"
          [32m+[0m[0m version   = "latest"
        }
    }

[1mPlan:[0m 19 to add, 1 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>